# ClearPresentationForAllBarsInRebarSet Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..RebarFailures..::..ClearPresentationForAllBarsInRebarSet Property
BuiltInFailures..::..RebarFailures Class See Also
---
All Bars in a Free Form Rebar Set have been hidden.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId ClearPresentationForAllBarsInRebarSet { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ClearPresentationForAllBarsInRebarSet As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ ClearPresentationForAllBarsInRebarSet {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..RebarFailures Class
Autodesk.Revit.DB Namespace